# Data Manipulation with Pandas
- provides an efficient implementation of a Dataframe
- A dataframe is a multidimensional array with attached row and column labels
- often with heterogeneous types and/or missing data

In [ ]:
import pandas
pandas.__version__

In [ ]:
# we generally import pandas as pd
import pandas as pd
import numpy as np

## Pandas Objects
Can be thought of as enhanced bersions of NumPy structed arrays where rows and columns are identified with labels rather than simple integer indices.

Lets examine the fundamental Pandas data structures:
- Series
- DataFrame
- Index

### The Pandas Series Object
- A 1-d array of indexed data.
- Wraps both a sequence of values and sequence of indices
- Can be accessed with the values and index attributes.

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

In [ ]:
# values are a numpy array
data.values

In [ ]:
# index is an array-like object of type pd.Index
data.index

In [ ]:
# Data can be access with square-bracket notation
data[1]

In [ ]:
data[1:3]

In [ ]:
# Series' index has explicitly defined indexs.
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a','b','c','d'])
data

In [ ]:
# Which can be accessed as
data['b']

In [ ]:
# We can use non-contiguous or non-sequential indices:
data = pd.Series([0.25,0.5,0.75,1.0],
                index=[2,5,3,7])
data

In [ ]:
data[5]

#### Series as a specialized dictionary
-  a structure which maps typed keys to a set of typed values

In [ ]:
population_dict = {'California': 23534,
                  'Texas': 346457,
                  'New York': 785643,
                  'Florida': 876543,
                  'Illinois': 1234576}
population = pd.Series(population_dict)
population

In [ ]:
# By default, the index is drawn from the sorted keys 
population['California']

In [ ]:
# Supports array-style slicing
population['California':'Illinois']

In [ ]:
#### Constructing Series Objects

In [ ]:
# From a list or numpy array
pd.Series([2,4,6])

In [ ]:
# from a scalar to fill the specified index
pd.Series(5, index=[100,200,300])

In [ ]:
# From a dictionary
pd.Series({2:'a', 1:'b', 3:'c'})

In [ ]:
# From a dictionary, but only the specified keys
pd.Series({2:'a',1:'b',3:'c'}, index=[3,2])

## Pandas DataFrame Object
A DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary.

### DataFrame as a generalized NumPy array
- an analog of a 2d array with both flexible row indices and flixible column names.

In [ ]:
# contruct a new Series
area_dict = {'California': 23453, 'Texas': 3456, 'New York': 234503409, 'Florida': 23453634, 'Illinois': 2345342}
area = pd.Series(area_dict)
area

In [ ]:
# From before..
population_dict = {'California': 38332521,
                   'Texas': 26448193,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}
population = pd.Series(population_dict)

# We can construct a single 2d object containing population info
states = pd.DataFrame({'population': population, 'area': area})
states

In [ ]:
# DataFrame has an index attribute to access index labels
states.index

In [ ]:
# It also has a column attribute to access the column labels
states.columns

### DataFrame as specialized dictionary
- maps column names to a Series of column data.

In [ ]:
states['area']

### Constructing DataFrame objects

In [ ]:
# DataFrame is a collection of Series objects. 
pd.DataFrame(population, columns=['population'])

In [ ]:
# Lists of dictionaries can be made into a DataFrame.
data = [{'a': i, 'b':2 * i}
       for i in range(3)]
pd.DataFrame(data)

In [ ]:
# PD will will missing values with NaN
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

In [ ]:
# Can be constructed from a dictionary of Series objects
pd.DataFrame({'population': population, 'area': area})

In [ ]:
# Can be constructed from a 2d array of data.
pd.DataFrame(np.random.rand(3, 2),
            columns=['foo', 'bar'],
            index=['a', 'b', 'c'])

In [ ]:
# Can be constructed from a structed array
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

In [ ]:
pd.DataFrame(A)

### The Pandas Index Object
- an immutable array, or ordered set

In [ ]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

In [ ]:
# Can retrieve values or slices
ind[1]

In [ ]:
ind[::2]

In [ ]:
# Has other attributes familiar from NumPy
print(ind.size, ind.shape, ind.ndim, ind.dtype)

In [ ]:
# Can't be modified by normal means
int[1] = 0

#### Index as an ordered set

In [ ]:
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])

In [ ]:
# intersection
indA & indB

In [ ]:
# union
indA | indB

In [ ]:
# symmetric difference
indA ^ indB

## Data indexing and selection
- Many of the same means of accessing and modifying values in Pandas as NumPy

In [ ]:
### Data selection in series
#### Series as a dictionary

In [ ]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index=['a', 'b', 'c', 'd'])
data

In [ ]:
data['b']

In [ ]:
# We can use dictionary-like python expressions and methods to examine keys/indices and values
'a' in data

In [ ]:
data.keys()

In [ ]:
list(data.items())

In [ ]:
# modify values
data['e'] = 1.25
data

#### Series as a 1d array

In [ ]:
# slicing by explicit index
data['a':'c']

In [ ]:
# slicing by implicit integer index
data[0:2]

In [ ]:
# masking
data[(data > 0.3) & (data < 0.8)]

In [ ]:
# fancy indexing
data[['a', 'e']]

#### Indexers: loc, iloc, ix

In [ ]:
data = pd.Series(['a', 'b', 'c'], index=[1,3,5])
data

In [ ]:
# explicit index when indexing
data[1]

In [ ]:
# implicit index when slicing
data[1:3]

In [ ]:
# indexing and slicing with loc always uses explicit index
data.loc[1]

In [ ]:
data.loc[1:3]

In [ ]:
# iloc allows indexing and slicing with implicit index
data.iloc[1]

In [ ]:
data.iloc[1:3]

### Data Selection in DataFrame
#### DataFrame as a dictionary
- lets consider the dataframe as a dictionary of related Series objects

In [ ]:
area = pd.Series({'Califonia':23454523, 'Texas': 23445, 'New York': 23890490, 'Florida': 23890450, 'Illinois': 2348035890})
pop = pd.Series({'Califonia':254523, 'Texas': 234453, 'New York': 238904, 'Florida': 290450, 'Illinois': 2348035})
data = pd.DataFrame({'area':area, 'pop': pop})
data

In [ ]:
# Individual series make up the columns can be accessed via dictionary style indexing of the column name
data['area']

In [ ]:
# We can also use attributes
data.area

In [ ]:
# it's the same thing 
data.area is data['area']

In [ ]:
# We can add data to dataframes
data['density'] = data['pop'] / data['area']
data

In [ ]:
#### DataFrame as a 2d array
data.values

In [ ]:
# We can transpose the data
data.T

In [ ]:
# Get a row
data.values[0]

In [ ]:
# get a column
data['area']

In [ ]:
# We can use iloc indexer to access data, maintaining dataframe index and column lavels
data.iloc[:3, :2]

In [ ]:
# loc indexer can be used with explicit index and coluimn names
data.loc[:'Illinois', :'pop']

In [ ]:
# ix index is a hybrid approach
data.ix[:3, :'pop']

In [ ]:
# We can use loc for masking and fancy indexing
data.loc[data.density > 10, ['pop', 'density']]

In [ ]:
# We can modify data with them too
data.iloc[0, 2] = 90
data

#### Additional indexing conventions
- index refers to columns
- slicing refers to rows

In [ ]:
data['Florida':'Illinois']

In [ ]:
# We can also refer to them as numbers
data[1:3]

In [ ]:
# Direct masking operations are row-wise
data[data.density > 10]

## Operation on Data in Pandas
- can perform numpy element-wise operations
- pandas keeps context when performing operations

### Ufuncs: index preservation

In [ ]:
import pandas as pd
import numpy as np

# define a series
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

In [ ]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                 columns=['A', 'B', 'C', 'D'])
df

In [ ]:
# applying a NumPy ufunc on either of these object will result in another pandas object with the indices preserved
np.exp(ser)

In [ ]:
# something more complicated
np.sin(df * np.pi / 4)

### UFuncs: Index Alignment
- for binary operations on 2 series or dataframe object, pandas will align indices. 
- this is useful when working with incomplete data

#### Index alignment in Series
- Lets combine 2 different data sources and find only the top 3 us states by area, and the top 3 states by population

In [ ]:
area = pd.Series({'Alaska': 123234, 'Texas': 234523,
                 'California': 457623}, name='area')
population = pd.Series({'Texas': 234523, 'California': 457623,
                'New York': 24523}, name='population')

In [ ]:
# calculate population density
population / area

In [ ]:
# The resulting array contains the unioni of indices.
# Could be found with
area.index | population.index

In [ ]:
# NaN is the default
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])
A + B

In [ ]:
# We can fill NaN with another number
A.add(B, fill_value=0)

#### Index Alignment in DataFrame
- similar alignment happens for dataframe on both row and column

In [ ]:
A = pd.DataFrame(rng.randint(0, 20, (2,2)), columns=list('AB'))
A

In [ ]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

In [ ]:
A + B

In [ ]:
# We can also fill values
# lets use the mean value of A, computed by stacking rows of A
fill = A.stack().mean()
A.add(B, fill_value=fill)

### Ufuncs: operations between dataframe and series
- column alignment is maintained in these cases as well

In [ ]:
# find the difference of a 2d array and one of it's rows
A = rng.randint(10, size=(3,4))
A

In [ ]:
A - A[0]

In [ ]:
# with a dataframe
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

In [ ]:
# now column-wise
df.subtract(df['R'], axis=0)

In [ ]:
# Automatic index alignment takes place
halfrow = df.iloc[0, ::2]
halfrow

In [ ]:
df - halfrow

## Handling Missing Data
- often, data will be missing from sources
- Lets learn how to represent this
- We will refer to missing data as:
    - null
    - NaN
    - NA

### Trade-offs in missing data conventions
- we can use a mask that globally indicates missing values
    - may use a bool array
    - or a bit in data represenation to indicate null status
    - additional overhead in both storage and computation
- or we can choose a sentinel value
    - may indicate using -9999 or some rate bit pattern
    - or NaN
    - require extra logic in CPU and GPU arithmetic
    - NaN may not be available for the data-type
   
### Missing Data in Pandas
- because of reliance on numpy, there is no built in notion of NA values for non-floating point data types
- Following R's strategy is unwieldly because of the many datatypes
- Pandas uses sentinels for missing data:
    - NaN
    - None
- tends to be a good compromise

#### None: Pythonic missing data
- a python singleton object that is often used for missing data
- can only be used in arrays with datatype `object`

In [ ]:
import numpy as np
import pandas as pd

vals1 = np.array([1, None, 3, 4])
vals1

# object is the best common type
# operations will be performed at python level

In [ ]:
# Operations are slower with this type
for dtype in ['object', 'int']:
    print('dtype =', dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

In [ ]:
# aggregations of python objects will result in an error
vals1.sum()

#### NaN: Missing numberical data
- a special floating-point value

In [ ]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

# numpy choses floating point for this array

In [ ]:
# NaN operations will result in NaN
1 + np.nan

In [ ]:
0 * np.nan

In [ ]:
# aggregations wont result in errors but aren't very useful
vals2.sum(), vals2.min(), vals2.max()

In [ ]:
# There are special aggregations that ignore NaN
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

#### NaN and None in pandas
- both have their place
- pandas will convert where appropriate

In [ ]:
pd.Series([1, np.nan, 2, None])

In [ ]:
# Pandas will type-case when NA values are present
x = pd.Series(range(2), dtype=int)
x

In [ ]:
x[0] = None
x

### Operating on Null values
- there are many methods for detecting, removing, and replacing null values
- isnull(): generate a boolean mask indicating missing values
- notnull(): opposite of isnull()
- dropna(): return filter version of the data
- fillna(): return a copy of the data with missing values filled or imputed

#### Detecting null values
- lets get a mask for all null values or nonnull values

In [ ]:
data = pd.Series([1, np.nan, 'hello', None])
data.isnull()

In [ ]:
data[data.notnull()]

#### Dropping null values

In [ ]:
data.dropna()

In [ ]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

In [ ]:
# Drop all rows in which any null value is present
df.dropna()

In [ ]:
# drop columns containing a null value
df.dropna(axis="columns")

In [ ]:
df[3] = np.nan
df

In [ ]:
# drop columns where all values are null values
df.dropna(axis='columns', how='all')

In [ ]:
# keep rows where a min number of non-null values are
df.dropna(axis='rows', thresh=3)

#### Fililng null values
- sometimes you may want to fill a null value with something that makes sense for the dataset

In [ ]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

In [ ]:
# fill null with 0
data.fillna(0)

In [ ]:
# forward-fill to propagate the previous value forward
data.fillna(method='ffill')

In [ ]:
# back-fill to propagate the next values backward
data.fillna(method='bfill')

In [ ]:
df

In [ ]:
# forward-fill a dataframe by specficing the axis
df.fillna(method='ffill', axis=1)

# null values remain if there is no previous value

## Hierarchical Indexing
- When we need to index at higher dimensions, we can use hierarchical indexing.
- This incorporates multiple index levels within a single index
- We will explore MultiIndex objects

In [1]:
import pandas as pd
import numpy as np

### Multiple Indexed Series
- Lets consider representing 2d data in a 1d series.

#### Pandas MultiIndex

In [5]:
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]

index = pd.MultiIndex.from_tuples(index)
index

# Contains multiple levels of indexing and multiple labels per datapoint

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [8]:
populations = [23423454, 345345,
              2342341, 678768,
              643278, 34565677]
pop = pd.Series(populations, index=index)
pop = pop.reindex(index)
pop

# The first 2 columns show labels and the last shows data
# Missing values means that it's the same as the value the row above

California  2000    23423454
            2010      345345
New York    2000     2342341
            2010      678768
Texas       2000      643278
            2010    34565677
dtype: int64

In [12]:
# access all data which the second index is 2010
pop[:, 2010]

California      345345
New York        678768
Texas         34565677
dtype: int64

#### MutliIndex as extra dimension
- We can use the unstack method to quickly convert a multi indexed Series into a DataFrame

In [15]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  23423454    345345
New York     2342341    678768
Texas         643278  34565677

In [17]:
# To convert from a dataframe to a mutliindex Series
pop_df.stack()

California  2000    23423454
            2010      345345
New York    2000     2342341
            2010      678768
Texas       2000      643278
            2010    34565677
dtype: int64

In [20]:
# add another column of data
pop_df = pd.DataFrame({'total': pop,
                      'under18': [2346345,234245234,
                                 36341435,23452453,
                                 234234235,34563453]})
pop_df

                    total    under18
California 2000  23423454    2346345
           2010    345345  234245234
New York   2000   2342341   36341435
           2010    678768   23452453
Texas      2000    643278  234234235
           2010  34565677   34563453

In [21]:
# Compute the fraction of people unser 18 by year
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                  2000        2010
California    0.100171  678.293399
New York     15.515006   34.551501
Texas       364.125984    0.999936

### Methods of MultiIndex Creation

In [23]:
df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'], [1,2,1,2]],
                 columns=['data1','data2'])
df

        data1     data2
a 1  0.094223  0.723727
  2  0.241645  0.386200
b 1  0.147553  0.948731
  2  0.455878  0.421788

In [24]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

#### Explicit MultiIndex Constructors

In [25]:
# From arrays
pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [26]:
# From a list of tuples
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [27]:
# From a cartesian product of single indices
pd.MultiIndex.from_product([['a','b'], [1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [28]:
# From internal encodings
pd.MultiIndex(levels=[['a','b'], [1,2]],
             labels=[[0,0,1,1], [0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

### MultiIndex level names
We can push a names argument to give labels

In [29]:
pop.index.names = ['states', 'year']
pop

states      year
California  2000    23423454
            2010      345345
New York    2000     2342341
            2010      678768
Texas       2000      643278
            2010    34565677
dtype: int64

### MultiIndex for columns
- Columns can have multiple levels as well

In [30]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013,2014], [1,2]],
                                  names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'], ['HR','Temp']],
                                    names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame 
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      23.0  37.7  22.0  36.5  33.0  38.7
     2      39.0  38.2  16.0  37.3  48.0  36.9
2014 1      38.0  36.1  44.0  36.6  39.0  37.8
     2      44.0  37.0  31.0  36.9  33.0  35.0

In [31]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      22.0  36.5
     2      16.0  37.3
2014 1      44.0  36.6
     2      31.0  36.9

### Indexing and slicing a multiindex
#### Multiply indexed series
- Consider the Series of state populations

In [32]:
pop

states      year
California  2000    23423454
            2010      345345
New York    2000     2342341
            2010      678768
Texas       2000      643278
            2010    34565677
dtype: int64

In [33]:
# Access single elements by indexing with multiple terms
pop['California', 2000]

23423454

In [34]:
# Access just 1 level with partial indexing
pop['California']

year
2000    23423454
2010      345345
dtype: int64

In [35]:
# Use Partial sorting on a sorted MultiIndex
pop.loc['California': 'New York']

states      year
California  2000    23423454
            2010      345345
New York    2000     2342341
            2010      678768
dtype: int64

In [36]:
# Use partial index on lower levels
pop[:, 2000]

states
California    23423454
New York       2342341
Texas           643278
dtype: int64

In [38]:
# selection with boolean mask
pop[pop > 2300000]

states      year
California  2000    23423454
New York    2000     2342341
Texas       2010    34565677
dtype: int64

In [39]:
# Selection based on fancy indexing
pop[['California', 'Texas']]

states      year
California  2000    23423454
            2010      345345
Texas       2000      643278
            2010    34565677
dtype: int64

#### Multiply Indexed DataFrames

In [40]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      23.0  37.7  22.0  36.5  33.0  38.7
     2      39.0  38.2  16.0  37.3  48.0  36.9
2014 1      38.0  36.1  44.0  36.6  39.0  37.8
     2      44.0  37.0  31.0  36.9  33.0  35.0

In [41]:
# Get Guido's heart rate data
health_data['Guido','HR']

year  visit
2013  1        22.0
      2        16.0
2014  1        44.0
      2        31.0
Name: (Guido, HR), dtype: float64

In [47]:
# We can do the same with iloc, loc, ix
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      23.0  37.7
     2      39.0  38.2

In [48]:
# loc and iloc can be passed a tuple of multiple indices
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        23.0
      2        39.0
2014  1        38.0
      2        44.0
Name: (Bob, HR), dtype: float64

In [49]:
# Get a slice with IndexSlice
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      23.0  22.0  33.0
2014 1      38.0  44.0  39.0

### Rearranging Multi-indices
- sometimes we need to rearrange the data for computation

#### Sorted and unsorted indices
- many multiindex slicing operations will fail if the index is not sorted

In [51]:
# create a non-lexographically sorted dataset
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.014237
      2      0.903485
c     1      0.279286
      2      0.004960
b     1      0.011698
      2      0.323127
dtype: float64

In [52]:
# if we try to take a partial slice with this it will produce an error
try:
    data['a': 'b']
except KeyError as e:
    print(type(e))
    print(e)

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [54]:
# sort the index 
data = data.sort_index()
data

char  int
a     1      0.014237
      2      0.903485
b     1      0.011698
      2      0.323127
c     1      0.279286
      2      0.004960
dtype: float64

In [55]:
data['a':'b']

char  int
a     1      0.014237
      2      0.903485
b     1      0.011698
      2      0.323127
dtype: float64

#### Stacking and unstacking indices
- convert a dataset

In [57]:
pop.unstack(level=0)

states  California  New York     Texas
year
2000      23423454   2342341    643278
2010        345345    678768  34565677

In [59]:
pop.unstack(level=1)

year            2000      2010
states
California  23423454    345345
New York     2342341    678768
Texas         643278  34565677

#### Index setting and resetting
- we can turn index levels into columns

In [61]:
pop_flat = pop.reset_index(name='population')
pop_flat

       states  year  population
0  California  2000    23423454
1  California  2010      345345
2    New York  2000     2342341
3    New York  2010      678768
4       Texas  2000      643278
5       Texas  2010    34565677

In [63]:
# it can be useful to convert flat data into a multiindex
pop_flat.set_index(['states', 'year'])

                 population
states     year
California 2000    23423454
           2010      345345
New York   2000     2342341
           2010      678768
Texas      2000      643278
           2010    34565677

### Data Aggregations on Mutli-Indices
- mean(), sum(), and max() can be passed a level index to determine how to aggregate data

In [65]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      23.0  37.7  22.0  36.5  33.0  38.7
     2      39.0  38.2  16.0  37.3  48.0  36.9
2014 1      38.0  36.1  44.0  36.6  39.0  37.8
     2      44.0  37.0  31.0  36.9  33.0  35.0

In [67]:
# average out measurements of the visits
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     31.0  37.95  19.0  36.90  40.5  37.8
2014     41.0  36.55  37.5  36.75  36.0  36.4

In [68]:
# Take mean amoung columns
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  30.166667  37.550000
2014  38.166667  36.566667

## Combining Datasets: Concat and Append
- It's important to know how to combine data sources and handle overlaps
- lets look at how to combine Series and DataFrames

In [2]:
import pandas as pd
import numpy as np

# Define a dataframe
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [4]:
# Define a function to render multiple dataframes side by side
class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}</div>"""
    
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                        for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                          for a in self.args)

### Recall: Concatentation of NumPy Arrays
- Concat of Series and DataFrame objects similar to NumPy arrays.

In [5]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]

np.concatenate([x, y, z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [9]:
# We can specify the axis along which the result will be concat
x = [[1, 2], 
    [3, 4]]
np.concatenate([x, x], axis=1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

### Simple Concatenation with pd.concat
- pd.concat() is similar to np.concatenate()

In [10]:
# concat 2 series
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [12]:
# Also works on Dataframes
# works axis=0 be default
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display('df1', 'df2', 'pd.concat([df1, df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1, df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [16]:
# concat along col
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

### Duplicate Indices
- Pandas preserves indices

In [17]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [18]:
# Catch repeats as an error
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print('ValueError:', e)

ValueError: Indexes have overlapping values: [0, 1]

In [19]:
# Ignore the index
display('x', 'y', 'pd.concat([x, y], ignore_index=True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index=True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [20]:
# Adding Multiindex keys
display('x', 'y', "pd.concat([x, y], keys=['x', 'y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], keys=['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

### Concatenation with joins
- we may need to join data that does not have the same column names

In [28]:
df5 = make_df('ABC', [1, 2])
df6 = make_df('BCD', [3, 4])

# outer join be default
display('df5', 'df6', 'pd.concat([df5, df6])')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [30]:
# use an inner join
display('df5', 'df6',
       "pd.concat([df5, df6], join='inner')")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [32]:
# specify which columns to keep
display('df5', 'df6',
       "pd.concat([df5, df6], join_axes=[df5.columns])")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join_axes=[df5.columns])
     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

## Append()
- a shorthand

In [34]:
display('df1', 'df2', 'df1.append(df2)')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

df1.append(df2)
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

## Combining Datasets: Merge and Join
- pandas offers high-performance, in-memory join and merge operations

In [1]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Relational Algebra
- pd.merge() is a subset of relational algebra
- this is a formal set of rules for manipulating relational data and forms the conceptual fondation of operations for most databases

### Categories of Joins
- There are 3 categories of joins:
 - one-to-one
 - many-to-one
 - many-to-many
 
#### One-to-one joins

In [4]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                   'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [5]:
# combine into a single dataframe
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### Many-to-one joins
- when one of the 2 key columns contains duplicate entries
- the resulting dataframe will preserve those duplicate entries

In [7]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                   'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

### Many-to-many joins
- if the key columns in both the left and right array contains duplicates, then the result is a many-to-many merge

In [8]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 
                             'Engineering', 'Engineering', 'HR', 'HR'],
                   'skills': ['math', 'spreadsheets', 'coding', 'linux',
                             'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Specification of the Merge key
- default behavior of pd.merge() is to look for one or more matching column names and use this as the key
- we may want a different behavior

#### The on keyword
- specify the name of the key column
- takes a name or a list of names

In [11]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

#### The left_on and right_on keywords
- sometimes we need to merge datasets with different column names

In [13]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'salary': [70000, 80000, 120000, 90000]})
display('df1', 'df3', 'pd.merge(df1, df3, left_on="employee", right_on="name")')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1, df3, left_on="employee", right_on="name")
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [14]:
# we can drop redundant columns
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

#### The left_index and right_index keywords
- we can merge on an index

In [16]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [17]:
# use index as a key for merging
display('df1a', 'df2a', "pd.merge(df1a, df2a, left_index=True, right_index=True)")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

pd.merge(df1a, df2a, left_index=True, right_index=True)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [18]:
# join merges on indices
display('df1a', 'df2a', 'df1a.join(df2a)')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

df1a.join(df2a)
                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [20]:
# Mix indices and columns
display('df1a', 'df3', "pd.merge(df1a, df3, left_index=True, right_on='name')")

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

pd.merge(df1a, df3, left_index=True, right_on='name')
         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

### Specifying Set Arithmetic for Joins
- We need to consider when a value in the key column is not in the other

In [4]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                   'food': ['fish', 'beans', 'bread']},
                  columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                   'drink': ['wine', 'beer']},
                  columns=['name', 'drink'])

# This is an inner join where only the interaction is kept
display('df6', 'df7', 'pd.merge(df6, df7)')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7)
   name   food drink
0  Mary  bread  wine

In [5]:
# also an inner
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

In [7]:
# Outer - union over input columns and fills the missing values
display('df6', 'df7', "pd.merge(df6, df7, how='outer')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='outer')
     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [10]:
# left joins over left entries
display('df6', 'df7', "pd.merge(df6, df7, how='left')")

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

pd.merge(df6, df7, how='left')
    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

### Overlapping Column Names: The suffixes keyword
- You may input 2 dataframes with conflicting column names

In [11]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                   'rank': [3, 1, 4, 2]})
display('df8', 'df9', 'pd.merge(df8, df9, on="name")')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name")
   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [13]:
# use custom suffixes
display('df8', 'df9', 'pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])
   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

### Example: US States Data
- lets consider different sources of data about the US states and their populations

In [2]:
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv
!curl -O https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 57935  100 57935    0     0   126k      0 --:--:-- --:--:-- --:--:--  147k
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   835  100   835    0     0   2531      0 --:--:-- --:--:-- --:--:--  2545
  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   872  100   872    0     0   2449      0 --:--:-- --:--:-- --:--:--  2463

In [3]:
# look at the three datasets using the pandas read_csv()
pop = pd.read_csv('data/state-population.csv')
areas = pd.read_csv('data/state-areas.csv')
abbrevs = pd.read_csv('data/state-abbrevs.csv')

display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [4]:
# We wnat to rank US states and terrietoris by their 2010 population density
# First we need to combine the datasets
# First we use a many-to-one merge to get the full state name
# Do this with the state/region column of pop and the abbrevation column of abbrevs.
# Use an other join to make sure no data is thrown away due to mismatched labels
merged = pd.merge(pop, abbrevs, how='outer',
                 left_on='state/region', right_on='abbreviation')
merged = merged.drop('abbreviation', 1) # drop duplicate info
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [5]:
# Check for mismatches by looking for rows with null
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [8]:
# Some of the population info is null, lets find it
# puerto rico data is null before the year 2000
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [9]:
# Some state entries are null, which means there are no corresponding entry in abbrevs key
merged.loc[merged['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [10]:
# It seems that there is no abbreviation key for PR and USA
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [11]:
# now lets merge the area data
# We want to join on the state column
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [12]:
# Check for mismatches
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [13]:
# there are nulls in the area column
# check which regions were ignored
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [14]:
# Ok, lets drop United States since it's not relevent
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [15]:
# Select the portion of data for the year 2000 and the total pop
data2010 = final.query("year == 2010 & ages == 'total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [16]:
# Now compute density and order it. 
# First reindex data on state
data2010.set_index('state', inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [17]:
density.sort_values(ascending=False, inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [18]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

## Aggregation and Grouping

In [20]:
import numpy as np
import pandas as pd

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

### Planets Data
- download exoplanet data

In [21]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [23]:
# Details of 1000+ exoplanets up to 2014
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

### Simple Aggregation in Pandas

In [24]:
# Series agg
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [25]:
ser.sum()

2.811925491708157

In [26]:
ser.mean()

0.5623850983416314

In [27]:
# Dataframe agg
df = pd.DataFrame({'A': rng.rand(5),
                  'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [28]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [29]:
# aggregate on row
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [30]:
# Describe can be used to compute several common aggs
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

Shows that the firs planet discovered was in 1989  
Half of all known discovered 2010 or after

### GroupBy: Split, Apply, Combine
- splits the data on a value of the specified key
- applys computation
- combines the data into an output array

In [31]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                  'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [33]:
df.groupby('key')

In [34]:
# apply an aggregate on the DataFrameGroupBy object
df.groupby('key').sum()

     data
key
A       3
B       5
C       7